app/controllers/records_controller.rb

  def index
    @is_rookie = @me.is_rookie? if @user == @me
    get_date_range
    @records = @user.records.time_in(@startDate, @endDate).order_by('time').all
    @record = Record.new
    @times = Common.time_to_string(@records, 'time')
    @target_times = Common.time_to_string(@records, 'target_time')

    unless session[:friend_ids]
      friends = @current_facebook_user.friends_with_this_app
      friend_ids = friends.map(&:id)
      session[:friend_ids] ||= friend_ids
    end

    @friends = User.order_by_last_record.find_all_by_fb_id(session[:friend_ids])
---
SELECT * FROM "records" WHERE (((time > '2009-11-18 16:00:00' AND time < '2009-11-26 15:59:59') AND ("records".user_id = 2)) AND ("records".user_id = 2)) ORDER BY time DESC
SELECT * FROM "users" WHERE ("users"."fb_id" = '--- !ruby/object:Facebooker::User

  def create
    @record = @user.records.new(params[:record])

    respond_to do |format|
      if @record.save
        status = @user.status
        status.cal_total_score(session[:friend_ids])
        @status_partial = "#{t('record.wake')}:#{@record.time.to_s(:hm)}
        #{t('status.average')}:#{status.average.to_s(:hm)}
        #{t('status.cont')}:#{status.continuous_num}"
        result = @record.success ? t('record.success') : t('record.fail')
        @result = "#{t('common.result')}: #{result}"

        flash[:notice] = 'Record was successfully created.'
        format.html { redirect_to(@record) }
        format.js
      else
        flash[:notice] = 'Record was created fail.'
        format.html { render :action => "new" }
        format.js   { render :update do |page|
          page.call(:alert, @record.errors.full_messages.join(','))
---
INSERT INTO "records" ("created_at", "updated_at", "time", "user_id", "target_time", "content", "success", "pri", "status") VALUES('2009-11-20 05:51:35', '2009-11-20 05:51:35', '2009-11-20 05:51:00', 1, '2009-11-20 05:51:00', 'ker', 't', 'f', NULL)
SELECT * FROM "records" WHERE (((time > '2009-11-25 16:00:00' AND time < '2009-11-29 15:59:59') AND ("records".user_id = 2)) AND ("records".user_id = 2)) ORDER BY time DESC
SELECT count(*) AS count_all FROM "records" WHERE (records.time > '2009-11-01 00:00:00') AND (("records".user_id = 1) AND ("records"."success" = 't')) ORDER BY id DESC

  def update

    respond_to do |format|
      if @record.update_attributes(params[:record])
        @user.status.cal_total_score(session[:friend_ids])

        flash[:notice] = 'Record was successfully updated.'
        format.html { redirect_to(@record) }
        format.js
      else
        format.html { render :action => "edit" }
        format.js   { render :update do |page|
          page.call(:alert, @record.errors.full_messages.join(','))
---
UPDATE "records" SET "updated_at" = '2009-11-22 12:12:09', "content" = 'ddddddddaaaa', "status" = 'f', "time" = '2009-11-22 12:11:43' WHERE "id" = 19
SELECT * FROM "records" WHERE (records.time > '2009-11-21 16:00:00' AND time < '2009-11-22 16:00:00') AND ("records".user_id = 2) ORDER BY time DESC LIMIT 1
SELECT count(*) AS count_all FROM "records" WHERE (time > '2009-11-24 01:27:43' and time < '2009-11-25 16:25:11') AND ("records".user_id = 2)

  def destroy
    @record.destroy
---
DELETE FROM "records" WHERE "id" = 6

  def find_record
    @record = @user.records.find(params[:id])
---
SELECT * FROM "records" WHERE (records.time > '2009-11-21 16:00:00' AND time < '2009-11-22 16:00:00') AND ("records".user_id = 2) ORDER BY time DESC LIMIT 1