app/controllers/records_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "target_time", "fb_id") VALUES('2009-11-20 14:42:07', '2009-11-20 14:42:07', NULL, 1524172451)
---
  def index
    @is_rookie = @me.is_rookie? if @user == @me
    get_date_range
    @records = @user.records.time_in(@startDate, @endDate).order_by('time').all
    @record = Record.new
    @times = Common.time_to_string(@records, 'time')
    @target_times = Common.time_to_string(@records, 'target_time')

    friends = @current_facebook_user.friends_with_this_app
    friend_ids = friends.map(&:id)
    session[:friend_ids] ||= friend_ids

    @friends = []
    friend_ids.each do |friend|
      user = User.find_by_fb_id(friend.to_s)
      user[:last_record_time] = user.status.last_record_at ? user.status.last_record_at : Time.zone.local(2000)
      @friends << user

SELECT * FROM "statuses" WHERE ("statuses".user_id = 1) LIMIT 1
---
  def create
    @record = @user.records.new(params[:record])

    respond_to do |format|
      if @record.save
        status = @user.status
        status.cal_total_score(session[:friend_ids])
        @status_partial = "#{t('status.score')}:#{status.total_score},
        #{t('status.num')}:#{status.num},
        #{t('status.rate')}:#{status.success_rate},
        #{t('status.average')}:#{status.average.to_s(:hm)},
        #{t('status.cont')}:#{status.continuous_num}"