app/controllers/users_controller.rb

  def update
    set_target_time
    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "target_time" = '2009-11-26 22:25:00', "timezone" = 'Tokyo', "updated_at" = '2009-11-26 16:09:09' WHERE "id" = 2